tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1828_tdd.h
#define STR1C                         522
#define STR1D                         523
#define STR1SYNC                      524
#define CCPR2L                        525
#define CCPR2H                        526
#define CCP2CON                       527
#define CCP2M                         528
#define CCP2M0                        529
#define CCP2M1                        530
#define CCP2M2                        531
#define CCP2M3                        532
#define DC2B                          533
#define DC2B0                         534
#define DC2B1                         535
#define P2M                           536
#define P2M0                          537
#define P2M1                          538
#define PWM2CON                       539
#define P2DC                          540
#define P2DC0                         541
#define P2DC1                         542
#define P2DC2                         543
#define P2DC3                         544
#define P2DC4                         545
#define P2DC5                         546
#define P2DC6                         547
#define P2RSEN                        548
#define PSS2BD                        549
#define PSS2BD0                       550
#define PSS2BD1                       551
#define PSS2AC0                       552
#define PSS2AC                        553
#define PSS2AC1                       554
#define CCP2AS0                       555
#define CCP2AS                        556
#define CCP2AS1                       557
#define CCP2AS2                       558
#define CCP2ASE                       559
#define PSTR2CON                      560
#define STR2A                         561
#define STR2B                         562
#define STR2C                         563
#define STR2D                         564
#define STR2SYNC                      565
#define CCPTMRS0                      566
#define C1TSEL0                       567
#define C1TSEL                        568
#define C1TSEL1                       569
#define C2TSEL0                       570
#define C2TSEL                        571
#define C2TSEL1                       572
#define C3TSEL0                       573
#define C3TSEL                        574
#define C3TSEL1                       575
#define C4TSEL                        576
#define C4TSEL0                       577
#define C4TSEL1                       578
#define CCPR3L                        579
#define CCPR3H                        580
#define CCP3CON                       581
#define CCP3M                         582
#define CCP3M0                        583
#define CCP3M1                        584
#define CCP3M2                        585
#define CCP3M3                        586
#define DC3B                          587
#define DC3B0                         588
#define DC3B1                         589
#define CCPR4L                        590
#define CCPR4H                        591
#define CCP4CON                       592
#define CCP4M                         593
#define CCP4M0                        594
#define CCP4M1                        595
#define CCP4M2                        596
#define CCP4M3                        597
#define DC4B0                         598
#define DC4B                          599
#define DC4B1                         600
#define INLVLA                        601
#define INLVLA0                       602
#define INLVLA1                       603
#define INLVLA2                       604
#define INLVLA3                       605
#define INLVLA4                       606
#define INLVLA5                       607
#define INLVLB4                       608
#define INLVLB                        609
#define INLVLB5                       610
#define INLVLB6                       611
#define INLVLB7                       612
#define INLVLC                        613
#define INLVLC0                       614
#define INLVLC1                       615
#define INLVLC2                       616
#define INLVLC3                       617
#define INLVLC4                       618
#define INLVLC5                       619
#define INLVLC6                       620
#define INLVLC7                       621
#define IOCAP                         622
#define IOCAP0                        623
#define IOCAP1                        624
#define IOCAP2                        625
#define IOCAP3                        626
#define IOCAP4                        627
#define IOCAP5                        628
#define IOCAN0                        629
#define IOCAN                         630
#define IOCAN1                        631
#define IOCAN2                        632
#define IOCAN3                        633
#define IOCAN4                        634
#define IOCAN5                        635
#define IOCAF0                        636
#define IOCAF                         637
#define IOCAF1                        638
#define IOCAF2                        639
#define IOCAF3                        640
#define IOCAF4                        641
#define IOCAF5                        642
#define IOCBP                         643
#define IOCBP4                        644
#define IOCBP5                        645
#define IOCBP6                        646
#define IOCBP7                        647
#define IOCBN4                        648
#define IOCBN                         649
#define IOCBN5                        650
#define IOCBN6                        651
#define IOCBN7                        652
#define IOCBF4                        653
#define IOCBF                         654
#define IOCBF5                        655
#define IOCBF6                        656
#define IOCBF7                        657
#define CLKRCON                       658
#define CLKRDIV                       659
#define CLKRDIV0                      660
#define CLKRDIV1                      661
#define CLKRDIV2                      662
#define CLKRDC                        663
#define CLKRDC0                       664
#define CLKRDC1                       665
#define CLKRSLR                       666
#define CLKROE                        667
#define CLKREN                        668
#define MDCON                         669
#define MDBIT                         670
#define MDOUT                         671
#define MDOPOL                        672
#define MDSLR                         673
#define MDOE                          674
#define MDEN                          675
#define MDSRC                         676
#define MDMS0                         677
#define MDMS                          678
#define MDMS1                         679
#define MDMS2                         680
#define MDMS3                         681
#define MDMSODIS                      682
#define MDCARL                        683
#define MDCL0                         684
#define MDCL                          685
#define MDCL1                         686
#define MDCL2                         687
#define MDCL3                         688
#define MDCLSYNC                      689
#define MDCLPOL                       690
#define MDCLODIS                      691
#define MDCARH                        692
#define MDCH                          693
#define MDCH0                         694
#define MDCH1                         695
#define MDCH2                         696
#define MDCH3                         697
#define MDCHSYNC                      698
#define MDCHPOL                       699
#define MDCHODIS                      700
#define TMR4                          701
#define PR4                           702
#define T4CON                         703
#define T4CKPS0                       704
#define T4CKPS                        705
#define T4CKPS1                       706
#define TMR4ON                        707
#define T4OUTPS                       708
#define T4OUTPS0                      709
#define T4OUTPS1                      710
#define T4OUTPS2                      711
#define T4OUTPS3                      712
#define TMR6                          713
#define PR6                           714
#define T6CON                         715
#define T6CKPS0                       716
#define T6CKPS                        717
#define T6CKPS1                       718
#define TMR6ON                        719
#define T6OUTPS0                      720
#define T6OUTPS                       721
#define T6OUTPS1                      722
#define T6OUTPS2                      723
#define T6OUTPS3                      724
#define STATUS_SHAD                   725
#define C_SHAD                        726
#define DC_SHAD                       727
#define Z_SHAD                        728
#define WREG_SHAD                     729
#define BSR_SHAD                      730
#define PCLATH_SHAD                   731
#define FSR0L_SHAD                    732
#define FSR0H_SHAD                    733
#define FSR1L_SHAD                    734
#define FSR1H_SHAD                    735
#define STKPTR                        736
#define TOSL                          737
#define TOSH                          738

#endif // _PIC16F1828_H_
